WELCOME = (
    "👋 Добро пожаловать, {first_name}!\n\n"
    "🕌 Халяль VPN — ваш безопасный и удобный способ обойти блокировки.\n\n"
    "🔐 Халяль серьёзно относится к вашей конфиденциальности.\n"
    "Наше приложение спроектировано таким образом, чтобы работать без сбора каких-либо пользовательских данных —\n"
    "❌ ни журналов\n"
    "❌ ни истории посещений\n"
    "❌ ни личной информации\n\n"
    "Ваша онлайн-деятельность — это **ваше личное дело**, и Халяль здесь, чтобы гарантировать, что так и останется. 🤝"
)

MAIN_MENU = "🏠 Главное меню"

CHOOSE_PLATFORM = "🔰 Выберите вашу платформу"

CONNECTION_INSTRUCTION = (
    "📖 Инструкция по подключению:\n\n"
    "1️⃣ Установите VPN\n\n"
    "2️⃣ Вставьте свою подписку в приложение, нажав вторую кнопку «Получить ключ»\n\n"
    "3️⃣ Нажмите на большую кнопку в приложении и наслаждайтесь работой!"
)

KEY_INFO = "🔑 Ваш VPN-ключ:\n\n<code>{key}</code>"

PLANFIX_CONNECTION_ERROR = "Ой, что-то сломалось... Попробуйте позже."
