WELCOME = (
    "👋 Добро пожаловать, {first_name}!\n\n"
    "🕌 Халяль VPN — ваш безопасный и удобный способ обойти блокировки.\n\n"
    "🔐 Халяль серьёзно относится к вашей конфиденциальности.\n"
    "Наше приложение спроектировано таким образом, чтобы работать без сбора каких-либо пользовательских данных —\n"
    "❌ ни журналов\n"
    "❌ ни истории посещений\n"
    "❌ ни личной информации\n\n"
    "Ваша онлайн-деятельность — это **ваше личное дело**, и Халяль здесь, чтобы гарантировать, что так и останется. 🤝"
)

MAIN_MENU = "🏠 <b>Главное меню</b>"

CHOOSE_PLATFORM = "🔰 <b>Выберите вашу платформу</b>"

CONNECTION_INSTRUCTION = (
    "📖 <b>Инструкция по подключению:</b>\n\n"
    '1️⃣ Нажмите кнопку "Скачать приложение" пройдите по ссылке и установите приложение.\n\n'
    '2️⃣ Нажмите на кнопку "Получить ключ" пройдите по ссылке, подождите пока ключ установится в приложение.\n\n'
    "3️⃣ Откройте приложение V2raytun и нажмите на большую синюю кнопку посередине."
)
CHOOSE_TARIFF = (
    "💰 <b>Выбери свой тариф:</b>\n\n"
    "1️⃣ месяц\n<s> 249 ₽ </s> ➜ <b>199 ₽</b>\n\n"
    "3️⃣ месяца\n<s> 597 ₽ </s> ➜ <b>499 ₽</b> (166 ₽/мес)\n\n"
    "6️⃣ месяцев + 1️⃣ в подарок! 🎁\n<s> 1393 ₽ </s> ➜ <b>999 ₽</b> (142 ₽/мес)\n\n"
    "1️⃣2️⃣ месяцев + 3️⃣ в подарок! 🎁\n<s> 2085 ₽ </s> ➜ <b>1999 ₽</b> (133 ₽/мес)\n\n"
    "📝 Выберите сумму, оплатите и пользуйтесь во благо Халяль VPN"
)
TARIFF_SELECTED = '✅ Вы выбрали тариф "{tariff}".\n\nСсылка на оплату поступит в течение ближайшего времени.'
REFERAL = (
    "💰 Если у тебя есть возможность привлекать клиентов, ты можешь пользоваться нашим ВПНом бесплатно.\n\n"
    "🎁 За каждого приведенного клиента добавляем 10 дней к пользованию ВПН.\n\n"
    "📲 Ты можешь поставить ее себе на статус вотцап или отправлять друзьям и близким.\n\n"
    "🔗 Твоя ссылка: <code>{ref_link}</code>"
)
HELP = "🛠 Пожалуйста, напишите о вашей проблеме прямо в чат ниже.\nМы свяжемся с вами в ближайшее время."

KEY_INFO = "🔑 Ваш VPN-ключ:\n\n<code>{key}</code>"
KEY_NOT_READY = "❗️ Ключ еще не готов. Дайте мне еще немного времени."

PLANFIX_CONNECTION_ERROR = "Ой, что-то сломалось... Попробуйте позже."
