WELCOME = (
    "👋 Добро пожаловать, {first_name}!\n\n"
    "🕌 Халяль VPN — ваш безопасный и удобный способ обойти блокировки.\n\n"
    "🔐 Халяль серьёзно относится к вашей конфиденциальности.\n"
    "Наше приложение спроектировано таким образом, чтобы работать без сбора каких-либо пользовательских данных —\n"
    "❌ ни журналов\n"
    "❌ ни истории посещений\n"
    "❌ ни личной информации\n\n"
    "Ваша онлайн-деятельность — это **ваше личное дело**, и Халяль здесь, чтобы гарантировать, что так и останется. 🤝"
)
