<script setup lang="ts">
import { useConfig } from '@/composables/useConfig';
import { computed } from 'vue';

const config = useConfig();

const siteHref = computed<string>(() => {
  return `<a href="${config.value.site.url}" target="_blank" rel="noopener noreferrer">${config.value.site.url}</a>`;
});
</script>
<template>
  <div class="text-small">
    <div class="section">
      <h3 class="text-small">ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</h3>
    </div>
    <div class="section">
      <p>
        Настоящее соглашение о конфиденциальности использования персональных данных (далее —
        Соглашение о конфиденциальности) регулирует порядок сбора, использования и разглашения
        Администрацией <span v-html="siteHref" /> (Агент) информации о Пользователе (Принципал),
        которая может быть признана конфиденциальной или является таковой в соответствии с
        законодательством РФ.
      </p>
      <p>
        Термины, используемые в настоящем Соглашении о конфиденциальности, если не указано иное,
        применяются на условиях и в значении, определённом Договором об оказании услуг.
      </p>
      <p>
        Факт использования Пользователем сервиса <span v-html="siteHref" />, а также оформление
        ежемесячной подписки на дисковое пространство являются полным и безоговорочным акцептом
        настоящего Соглашения. Незнание указанных соглашений не освобождает Пользователя от
        ответственности за несоблюдение их условий.
      </p>
      <p>
        Если Пользователь не согласен с условиями настоящего Соглашения или не имеет права на его
        заключение, Пользователю следует незамедлительно прекратить любое использование
        <span v-html="siteHref" />.
      </p>
    </div>
    <div class="section">
      <h3 class="text-small">1. ИСТОЧНИКИ ИНФОРМАЦИИ</h3>
      <p>
        1.1 Информация, о которой идёт речь в настоящем Соглашении, может быть персонифицированной
        (прямо относящейся к конкретному лицу или ассоциируемой с ним) и не персонифицированной
        (данные о Пользователе <span v-html="siteHref" />, полученные без привязки к конкретному
        лицу).
      </p>
      <p>
        1.2 Администрации доступна информация, получаемая следующими способами: информация,
        полученная при переписке Администрации с Пользователями
        <span v-html="siteHref" /> посредством электронной почты; информация, предоставляемая
        Пользователями при регистрации на <span v-html="siteHref" /> и оформлении подписки на
        дисковое пространство, в рамках мероприятий, проводимых Администрацией
        <span v-html="siteHref" />, опросах, заявках, формах обратной связи, путём внесения записей
        в регистрационные онлайн-формы; техническая информация — данные об интернет-провайдере
        Пользователя, IP-адресе Пользователя, характеристиках используемого ПК и программного
        обеспечения, данные о загруженных и выгруженных на <span v-html="siteHref" /> файлах и т.п.;
        статистические данные о предпочтениях отдельно взятого Пользователя (тематика просмотренных
        страниц, объём используемого дискового пространства).
      </p>
      <p>
        1.3 Конфиденциальной, согласно настоящему Соглашению, может быть признана лишь информация,
        хранящаяся в базе данных <span v-html="siteHref" /> в зашифрованном виде и доступная для
        просмотра исключительно Администрации <span v-html="siteHref" />.
      </p>
      <p>
        1.4 Информация о лице, добровольно размещённая им в общих разделах
        <span v-html="siteHref" /> при заполнении регистрационных форм и доступная любому другому
        пользователю <span v-html="siteHref" />, или информация, которая может быть свободно
        получена из других общедоступных источников, не является конфиденциальной.
      </p>
    </div>

    <div class="section">
      <h3 class="text-small">2. БЕЗОПАСНОСТЬ</h3>
      <p>
        2.1 Администрация <span v-html="siteHref" /> использует современные технологии обеспечения
        конфиденциальности персональных данных, данных, полученных из регистрационных форм,
        оставляемых Пользователями <span v-html="siteHref" />, с целью обеспечения информации.
      </p>
      <p>
        2.2 Доступ к личной информации Пользователя осуществляется через систему авторизации с
        логином и паролем. Пользователь обязуется самостоятельно обеспечить сохранность
        авторизационных данных и ни под каким предлогом не разглашать их третьим лицам. Любые
        изменения личной информации, внесённые посредством авторизационных данных, будут считаться
        осуществлёнными лично Пользователем.
      </p>
      <p>
        2.3 Сбор, хранение, использование, обработка, разглашение информации, полученной
        Администрацией <span v-html="siteHref" /> в результате посещения пользователем
        <span v-html="siteHref" /> и/или заполнения регистрационных форм, в том числе персональные
        данные пользователей, осуществляется Администрацией <span v-html="siteHref" /> в
        соответствии с законодательством РФ.
      </p>
      <p>
        2.4 Пользователь осознаёт и предоставляет согласие на сбор и обработку своих персональных
        данных Администрацией <span v-html="siteHref" /> в рамках и с целью, предусмотренными
        условиями Договора об оказании услуг; обязуется уведомлять Администрацию
        <span v-html="siteHref" /> об изменениях его персональных данных.
      </p>
    </div>

    <div class="section">
      <h3 class="text-small">3. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h3>
      <p>
        3.1 Пользователь, заинтересованный в услугах <span v-html="siteHref" />, проходит
        регистрацию и оформляет ежемесячную подписку на дисковое пространство через сайт
        <span v-html="siteHref" />. При оформлении подписки Пользователь указывает E-mail учётной
        записи, выбранный тарифный план, объём дискового пространства, а также платёжные реквизиты
        для осуществления ежемесячных списаний.
      </p>
      <p>
        3.2 Деятельность Администрации <span v-html="siteHref" /> осуществляется в соответствии с
        законодательством РФ. Любые претензии, споры, официальные обращения будут рассматриваться
        исключительно в порядке, предусмотренном законодательством РФ.
      </p>
      <p>
        3.3 Администрация <span v-html="siteHref" /> не несёт ответственности за любые прямые или
        косвенные убытки, понесённые Пользователями или третьими сторонами, а также за упущенную
        выгоду при использовании, невозможности использования или результатов использования
        <span v-html="siteHref" />.
      </p>
      <p>
        3.4 Условия настоящего Соглашения могут быть изменены Администрацией
        <span v-html="siteHref" /> в одностороннем порядке.
      </p>
    </div>
  </div>
</template>

<style scoped lang="scss">
.section {
  margin-bottom: 15px;

  h3 {
    color: var(--primary);
    margin-bottom: 8px;
  }
}
</style>
