<script setup lang="ts">
import { useConfig } from '@/composables/useConfig';

const config = useConfig();
</script>
<template>
  <div class="text-small">
    <div class="section">
      <h3 class="text-small">ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</h3>
    </div>
    <div class="section">
      <p>
        Настоящее соглашение о конфиденциальности использования персональных данных (далее —
        Соглашение о конфиденциальности) регулирует порядок сбора, использования и разглашения
        Администрацией {{ config.site.url }} (Агент) информации о Пользователе (Принципал), которая
        может быть признана конфиденциальной или является таковой в соответствии с законодательством
        РФ.
      </p>
      <p>
        Термины, используемые в настоящем Соглашении о конфиденциальности, если не указано иное,
        применяются на условиях и в значении, определённом Договором об оказании услуг.
      </p>
      <p>
        Факт использования Пользователем сервиса {{ config.site.url }}, а также оформление
        ежемесячной подписки на дисковое пространство являются полным и безоговорочным акцептом
        настоящего Соглашения. Незнание указанных соглашений не освобождает Пользователя от
        ответственности за несоблюдение их условий.
      </p>
      <p>
        Если Пользователь не согласен с условиями настоящего Соглашения или не имеет права на его
        заключение, Пользователю следует незамедлительно прекратить любое использование
        {{ config.site.url }}.
      </p>
    </div>
    <div class="section">
      <h3 class="text-small">1. ИСТОЧНИКИ ИНФОРМАЦИИ</h3>
      <p>
        1.1 Информация, о которой идёт речь в настоящем Соглашении, может быть персонифицированной
        (прямо относящейся к конкретному лицу или ассоциируемой с ним) и не персонифицированной
        (данные о Пользователе {{ config.site.url }}, полученные без привязки к конкретному лицу).
      </p>
      <p>
        1.2 Администрации доступна информация, получаемая следующими способами: информация,
        полученная при переписке Администрации с Пользователями {{ config.site.url }} посредством
        электронной почты; информация, предоставляемая Пользователями при регистрации на
        {{ config.site.url }} и оформлении подписки на дисковое пространство, в рамках мероприятий,
        проводимых Администрацией {{ config.site.url }}, опросах, заявках, формах обратной связи,
        путём внесения записей в регистрационные онлайн-формы; техническая информация — данные об
        интернет-провайдере Пользователя, IP-адресе Пользователя, характеристиках используемого ПК и
        программного обеспечения, данные о загруженных и выгруженных на {{ config.site.url }} файлах
        и т.п.; статистические данные о предпочтениях отдельно взятого Пользователя (тематика
        просмотренных страниц, объём используемого дискового пространства).
      </p>
      <p>
        1.3 Конфиденциальной, согласно настоящему Соглашению, может быть признана лишь информация,
        хранящаяся в базе данных {{ config.site.url }} в зашифрованном виде и доступная для
        просмотра исключительно Администрации {{ config.site.url }}.
      </p>
      <p>
        1.4 Информация о лице, добровольно размещённая им в общих разделах
        {{ config.site.url }} при заполнении регистрационных форм и доступная любому другому
        пользователю {{ config.site.url }}, или информация, которая может быть свободно получена из
        других общедоступных источников, не является конфиденциальной.
      </p>
    </div>

    <div class="section">
      <h3 class="text-small">2. БЕЗОПАСНОСТЬ</h3>
      <p>
        2.1 Администрация {{ config.site.url }} использует современные технологии обеспечения
        конфиденциальности персональных данных, данных, полученных из регистрационных форм,
        оставляемых Пользователями {{ config.site.url }}, с целью обеспечения максимальной защиты
        информации.
      </p>
      <p>
        2.2 Доступ к личной информации Пользователя осуществляется через систему авторизации с
        логином и паролем. Пользователь обязуется самостоятельно обеспечить сохранность
        авторизационных данных и ни под каким предлогом не разглашать их третьим лицам. Любые
        изменения личной информации, внесённые посредством авторизационных данных, будут считаться
        осуществлёнными лично Пользователем.
      </p>
      <p>
        2.3 Сбор, хранение, использование, обработка, разглашение информации, полученной
        Администрацией {{ config.site.url }} в результате посещения пользователем
        {{ config.site.url }} и/или заполнения регистрационных форм, в том числе персональные данные
        пользователей, осуществляется Администрацией {{ config.site.url }} в соответствии с
        законодательством РФ.
      </p>
      <p>
        2.4 Пользователь осознаёт и предоставляет согласие на сбор и обработку своих персональных
        данных Администрацией {{ config.site.url }} в рамках и с целью, предусмотренными условиями
        Договора об оказании услуг; обязуется уведомлять Администрацию {{ config.site.url }} об
        изменениях его персональных данных.
      </p>
    </div>

    <div class="section">
      <h3 class="text-small">3. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h3>
      <p>
        3.1 Пользователь, заинтересованный в услугах {{ config.site.url }}, проходит регистрацию и
        оформляет ежемесячную подписку на дисковое пространство через сайт {{ config.site.url }}.
        При оформлении подписки Пользователь указывает E-mail учётной записи, выбранный тарифный
        план, объём дискового пространства, а также платёжные реквизиты для осуществления
        ежемесячных списаний.
      </p>
      <p>
        3.2 Деятельность Администрации {{ config.site.url }} осуществляется в соответствии с
        законодательством РФ. Любые претензии, споры, официальные обращения будут рассматриваться
        исключительно в порядке, предусмотренном законодательством РФ.
      </p>
      <p>
        3.3 Администрация {{ config.site.url }} не несёт ответственности за любые прямые или
        косвенные убытки, понесённые Пользователями или третьими сторонами, а также за упущенную
        выгоду при использовании, невозможности использования или результатов использования
        {{ config.site.url }}.
      </p>
      <p>
        3.4 Условия настоящего Соглашения могут быть изменены Администрацией
        {{ config.site.url }} в одностороннем порядке.
      </p>
    </div>
  </div>
</template>

<style scoped lang="scss">
.section {
  margin-bottom: 15px;

  h3 {
    color: var(--primary);
    margin-bottom: 8px;
  }
}
</style>
