<script setup lang="ts">
import { useConfig } from '@/composables/useConfig';
import { computed } from 'vue';

const config = useConfig();
const siteHref = computed<string>(() => {
  return `<a href="${config.value.site.url}" target="_blank" rel="noopener noreferrer">${config.value.site.url}</a>`;
});

</script>
<template>
  <div class="text-small">
    <div class="section">
      <h3 class="text-small">ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ</h3>
      <p>
        Настоящее Пользовательское соглашение (далее — «Соглашение») является публичной офертой и
        определяет условия использования сервиса
        <span v-html="siteHref" />
        (далее — «Сервис»), между Администрацией Сервиса (далее — «Администрация») и Пользователем (далее — «Пользователь»).
      </p>
    </div>
    <div class="section">
      <h3 class="text-small">1. Предмет соглашения</h3>
      <p>
        1.1. Администрация предоставляет Пользователю доступ к Сервису и его функционалу на
        условиях, изложенных в настоящем Соглашении.
      </p>
      <p>
        1.2. Пользователь, используя Сервис, подтверждает своё полное и безоговорочное согласие с
        условиями настоящего Соглашения.
      </p>
      <p>1.3. Настоящее Соглашение является юридически обязательным документом.</p>
    </div>
    <div class="section">
      <h3 class="text-small">2. Описание Сервиса и его функциональности</h3>
      <p>
        2.1. Сервис <span v-html="siteHref" />
        предназначен для предоставления Пользователям ежемесячной
        подписки на облачное дисковое пространство для хранения, загрузки и управления файлами.
      </p>
      <p>
        2.2. Перечень функций и возможностей Сервиса может быть изменён Администрацией без
        предварительного уведомления Пользователя.
      </p>
    </div>
    <div class="section">
      <h3 class="text-small">3. Правила использования Сервиса</h3>
      <p>
        3.1. Пользователь обязуется использовать Сервис исключительно в соответствии с его целевым
        назначением и в рамках действующего законодательства.
      </p>
      <p>
        3.2. Пользователь не имеет права:
        <ul style="padding-left: 20px">
          <li>Пытаться получить несанкционированный доступ к информации,
            содержащейся в Сервисе или в данных других Пользователей.</li>
          <li>Использовать Сервис для хранения и распространения вредоносного программного обеспечения, спама или другой незаконной информации.</li>
          <li>Вмешиваться в работу Сервиса, изменять его код или функциональность.</li>
          <li>Нарушать права третьих лиц при использовании Сервиса.</li>
          <li>Использовать дисковое пространство в целях, нарушающих действующее законодательство РФ.</li>
        </ul>
      </p>
      <p>
        3.3. Администрация оставляет за собой право ограничить или прекратить доступ Пользователя к
        Сервису в случае нарушения им условий настоящего Соглашения.
      </p>
    </div>
    <div class="section">
      <h3 class="text-small">4. Ответственность сторон</h3>
      <p>
        4.1. Администрация не несёт ответственности за убытки, причинённые Пользователю в результате
        использования Сервиса, в том числе за возможные ошибки в работе Сервиса, перерывы в работе,
        потерю данных и т.д.</p>
      <p>
        4.2. Пользователь несёт полную ответственность за свои действия при
        использовании Сервиса, а также за последствия таких действий, включая содержимое файлов,
        размещённых на дисковом пространстве.</p>
      <p>
        4.3. Администрация не несёт ответственности за
        содержание информации и файлов, размещённых Пользователем в рамках Сервиса.
      </p>
    </div>
    <div class="section">
      <h3 class="text-small">5. Обработка персональных данных</h3>
      <p>
        5.1. Администрация обязуется соблюдать конфиденциальность персональных данных Пользователя,
        полученных в процессе использования Сервиса.</p>
      <p>
        5.2. Подробная информация об обработке
        персональных данных содержится в Политике конфиденциальности, являющейся неотъемлемой частью
        настоящего Соглашения.
      </p>
    </div>
    <div class="section">
      <h3 class="text-small">6. Подписка и оплата</h3>
      <p>
        6.1. Доступ к дисковому пространству предоставляется на основании ежемесячной подписки в
        соответствии с выбранным тарифным планом.
      </p>
      <p>
        6.2. Оплата производится в порядке и сроки,
        установленные на сайте <span v-html="siteHref" />.
      </p>
      <p>
        6.3. Администрация оставляет за собой право
        изменять стоимость тарифных планов, уведомив Пользователя не менее чем за 7 (семь)
        календарных дней до вступления изменений в силу.
      </p>
    </div>
    <div class="section">
      <h3 class="text-small">7. Срок действия и порядок изменения Соглашения</h3>
      <p>
        7.1. Настоящее Соглашение вступает в силу с момента его принятия Пользователем и действует
        бессрочно.
      </p>
      <p>
        7.2. Администрация оставляет за собой право вносить изменения в настоящее
        Соглашение. Информация об изменениях будет размещена на сайте
        <span v-html="siteHref" />.
        Пользователь считается принявшим изменения, если он продолжает использовать Сервис после их
        внесения.
      </p>
    </div>
    <div class="section">
      <h3 class="text-small">8. Разрешение споров</h3>
      <p>
        8.1. Все споры, возникающие между Администрацией и Пользователем в связи с настоящим
        Соглашением, подлежат разрешению в порядке, предусмотренном действующим законодательством
        РФ.
      </p>
      <p>
        8.2. Если какое-либо положение настоящего Соглашения будет признано недействительным,
        это не повлияет на действительность остальных положений.
      </p>
    </div>
    <div class="section">
      <h3 class="text-small">9. Прочие условия</h3>
      <p>
        9.1. Во всём остальном, что не предусмотрено настоящим Соглашением, стороны руководствуются
        действующим законодательством РФ.
      </p>
      <p>
        9.2. Если какое-либо положение настоящего Соглашения будет
        признано недействительным, это не повлияет на действительность остальных положений.
      </p>
    </div>
    <div class="section">
      <h3 class="text-small">Контактная информация Администрации</h3>
      <p>
        <strong>Сайт:</strong> <span v-html="siteHref" />
      </p>
      <p>
        По всем вопросам, связанным с работой Сервиса, Пользователь может
        обратиться в службу поддержки через форму обратной связи на сайте
        <span v-html="siteHref" />.
      </p>
    </div>
  </div>
</template>
<style scoped lang="scss">
.section {
  margin-bottom: 15px;

  h3 {
    color: var(--primary);
    margin-bottom: 8px;
  }
}
</style>
